burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_usart.h
/*!
    \file    gd32e51x_usart.h
    \brief   definitions for the USART

    \version 2024-12-30, V1.2.0, firmware for GD32E51x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32E51X_USART_H
#define GD32E51X_USART_H

#include "gd32e51x.h"

/* USARTx(x=0,1,2,5)/UARTx(x=3,4) definitions */
#define USART1                        USART_BASE                     /*!< USART1 base address */
#define USART2                        (USART_BASE+0x00000400U)       /*!< USART2 base address */
#define UART3                         (USART_BASE+0x00000800U)       /*!< UART3 base address */
#define UART4                         (USART_BASE+0x00000C00U)       /*!< UART4 base address */
#define USART0                        (USART_BASE+0x0000F400U)       /*!< USART0 base address */
#define USART5                        (USART_BASE+0x00012C00U)       /*!< USART5 base address */

/* USART registers definitions */
/* USARTx(x=0,1,2)/UARTx(x=3,4)registers definitions */
#define USART_STAT0(usartx)           REG32((usartx) + 0x000000000U)        /*!< USART status register 0 */
#define USART_DATA(usartx)            REG32((usartx) + 0x000000004U)        /*!< USART data register */
#define USART_BAUD(usartx)            REG32((usartx) + 0x000000008U)        /*!< USART baud rate register */
#define USART_CTL0(usartx)            REG32((usartx) + 0x00000000CU)        /*!< USART control register 0 */
#define USART_CTL1(usartx)            REG32((usartx) + 0x000000010U)        /*!< USART control register 1 */
#define USART_CTL2(usartx)            REG32((usartx) + 0x000000014U)        /*!< USART control register 2 */
#define USART_GP(usartx)              REG32((usartx) + 0x000000018U)        /*!< USART guard time and prescaler register */
#define USART_CTL3(usartx)            REG32((usartx) + 0x000000080U)        /*!< USART control register 3 */
#define USART_RT(usartx)              REG32((usartx) + 0x000000084U)        /*!< USART receiver timeout register */
#define USART_STAT1(usartx)           REG32((usartx) + 0x000000088U)        /*!< USART status register 1 */
#define USART_GDCTL(usartx)           REG32((usartx) + 0x0000000D0U)        /*!< USART GD control register */

/* USART5 registers definitions */
#define USART5_CTL0(usartx)           REG32((usartx) + 0x000000000U)        /*!< USART5 control register 0 */
#define USART5_CTL1(usartx)           REG32((usartx) + 0x000000004U)        /*!< USART5 control register 1 */
#define USART5_CTL2(usartx)           REG32((usartx) + 0x000000008U)        /*!< USART5 control register 2 */
#define USART5_BAUD(usartx)           REG32((usartx) + 0x00000000CU)        /*!< USART5 baud rate register */
#define USART5_GP(usartx)             REG32((usartx) + 0x000000010U)        /*!< USART5 guard time and prescaler register */
#define USART5_RT(usartx)             REG32((usartx) + 0x000000014U)        /*!< USART5 receiver timeout register */
#define USART5_CMD(usartx)            REG32((usartx) + 0x000000018U)        /*!< USART5 command register */
#define USART5_STAT(usartx)           REG32((usartx) + 0x00000001CU)        /*!< USART5 status register */
#define USART5_INTC(usartx)           REG32((usartx) + 0x000000020U)        /*!< USART5 interrupt status clear register */
#define USART5_RDATA(usartx)          REG32((usartx) + 0x000000024U)        /*!< USART5 receive data register */
#define USART5_TDATA(usartx)          REG32((usartx) + 0x000000028U)        /*!< USART5 transmit data register */
#define USART5_CHC(usartx)            REG32((usartx) + 0x0000000C0U)        /*!< USART5 coherence control register */
#define USART5_RFCS(usartx)           REG32((usartx) + 0x0000000D0U)        /*!< USART5 receive FIFO control and status register */

/* USART bits definitions */
/* USARTx(x=0,1,2)/UARTx(x=3,4) bits definitions */
/* USARTx_STAT0 */
#define USART_STAT0_PERR              BIT(0)       /*!< parity error flag */
#define USART_STAT0_FERR              BIT(1)       /*!< frame error flag */
#define USART_STAT0_NERR              BIT(2)       /*!< noise error flag */
#define USART_STAT0_ORERR             BIT(3)       /*!< overrun error */
#define USART_STAT0_IDLEF             BIT(4)       /*!< IDLE frame detected flag */
#define USART_STAT0_RBNE              BIT(5)       /*!< read data buffer not empty */
#define USART_STAT0_TC                BIT(6)       /*!< transmission complete */
#define USART_STAT0_TBE               BIT(7)       /*!< transmit data buffer empty */
#define USART_STAT0_LBDF              BIT(8)       /*!< LIN break detected flag */
#define USART_STAT0_CTSF              BIT(9)       /*!< CTS change flag */

