burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_usart.h
/* USART5_BAUD */
#define USART5_BAUD_FRADIV             BITS(0,3)        /*!< fraction of baud-rate divider */
#define USART5_BAUD_INTDIV             BITS(4,15)       /*!< integer of baud-rate divider */

/* USART5_GP */
#define USART5_GP_PSC                  BITS(0,7)        /*!< prescaler value for dividing the system clock */
#define USART5_GP_GUAT                 BITS(8,15)       /*!< guard time value in smartcard mode */

/* USART5_RT */
#define USART5_RT_RT                   BITS(0,23)       /*!< receiver timeout threshold */
#define USART5_RT_BL                   BITS(24,31)      /*!< block length */

/* USART5_CMD */
#define USART5_CMD_SBKCMD              BIT(1)           /*!< send break command */
#define USART5_CMD_MMCMD               BIT(2)           /*!< mute mode command */
#define USART5_CMD_RXFCMD              BIT(3)           /*!< receive data flush command */
#define USART5_CMD_TXFCMD              BIT(4)           /*!< transmit data flush request */

/* USART5_STAT */
#define USART5_STAT_PERR               BIT(0)           /*!< parity error flag */
#define USART5_STAT_FERR               BIT(1)           /*!< frame error flag */
#define USART5_STAT_NERR               BIT(2)           /*!< noise error flag */
#define USART5_STAT_ORERR              BIT(3)           /*!< overrun error */
#define USART5_STAT_IDLEF              BIT(4)           /*!< idle line detected flag */
#define USART5_STAT_RBNE               BIT(5)           /*!< read data buffer not empty */
#define USART5_STAT_TC                 BIT(6)           /*!< transmission completed */
#define USART5_STAT_TBE                BIT(7)           /*!< transmit data register empty */
#define USART5_STAT_LBDF               BIT(8)           /*!< LIN break detected flag */
#define USART5_STAT_RTF                BIT(11)          /*!< receiver timeout flag */
#define USART5_STAT_EBF                BIT(12)          /*!< end of block flag */
#define USART5_STAT_BSY                BIT(16)          /*!< busy flag */
#define USART5_STAT_AMF                BIT(17)          /*!< address match flag */
#define USART5_STAT_SBF                BIT(18)          /*!< send break flag */
#define USART5_STAT_RWU                BIT(19)          /*!< receiver wakeup from mute mode */
#define USART5_STAT_WUF                BIT(20)          /*!< wakeup from deep-sleep mode flag */
#define USART5_STAT_TEA                BIT(21)          /*!< transmit enable acknowledge flag */
#define USART5_STAT_REA                BIT(22)          /*!< receive enable acknowledge flag */

/* USART5_INTC */
#define USART5_INTC_PEC                BIT(0)           /*!< parity error clear */
#define USART5_INTC_FEC                BIT(1)           /*!< frame error flag clear */
#define USART5_INTC_NEC                BIT(2)           /*!< noise detected clear */
#define USART5_INTC_OREC               BIT(3)           /*!< overrun error clear */
#define USART5_INTC_IDLEC              BIT(4)           /*!< idle line detected clear */
#define USART5_INTC_TCC                BIT(6)           /*!< transmission complete clear */
#define USART5_INTC_LBDC               BIT(8)           /*!< LIN break detected clear */
#define USART5_INTC_RTC                BIT(11)          /*!< receiver timeout clear */
#define USART5_INTC_EBC                BIT(12)          /*!< end of timeout clear */
#define USART5_INTC_AMC                BIT(17)          /*!< address match clear */
#define USART5_INTC_WUC                BIT(20)          /*!< wakeup from deep-sleep mode clear */

/* USART5_RDATA */
#define USART5_RDATA_RDATA             BITS(0,8)        /*!< receive data value */

/* USART5_TDATA */
#define USART5_TDATA_TDATA             BITS(0,8)        /*!< transmit data value */

/* USART5_CHC */
#define USART5_CHC_EPERR               BIT(8)           /*!< early parity error flag */

/* USART5_RFCS */
#define USART5_RFCS_ELNACK             BIT(0)           /*!< early NACK */
#define USART5_RFCS_RFEN               BIT(8)           /*!< receive FIFO enable */
#define USART5_RFCS_RFFIE              BIT(9)           /*!< receive FIFO full interrupt enable */
#define USART5_RFCS_RFE                BIT(10)          /*!< receive FIFO empty flag */
#define USART5_RFCS_RFF                BIT(11)          /*!< receive FIFO full flag */
#define USART5_RFCS_RFCNT              BITS(12,14)      /*!< receive FIFO counter number */
#define USART5_RFCS_RFFINT             BIT(15)          /*!< receive FIFO full interrupt flag */

/* USARTx(x=0,1,2,5)/UARTx(x=3,4) constants definitions */
/* define the USART bit position and its register index offset */
#define USART_REGIDX_BIT(regidx, bitpos)    (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define USART_REG_VAL(usartx, offset)       (REG32((usartx) + (((uint32_t)(offset) & 0xFFFFU) >> 6)))
#define USART_BIT_POS(val)                  ((uint32_t)(val) & 0x1FU)
#define USART_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define USART_REG_VAL2(usartx, offset)      (REG32((usartx) + ((uint32_t)(offset) >> 22)))
#define USART_BIT_POS2(val)                 (((uint32_t)(val) & 0x1F0000U) >> 16)

/* USART register offset */
/* USARTx(x=0,1,2)/UARTx(x=3,4) register offset */
#define USART_STAT0_REG_OFFSET              0x00000000U            /*!< STAT0 register offset */
#define USART_STAT1_REG_OFFSET              0x00000088U            /*!< STAT1 register offset */
#define USART_CTL0_REG_OFFSET               0x0000000CU            /*!< CTL0 register offset */
#define USART_CTL1_REG_OFFSET               0x00000010U            /*!< CTL1 register offset */
#define USART_CTL2_REG_OFFSET               0x00000014U            /*!< CTL2 register offset */
#define USART_CTL3_REG_OFFSET               0x00000080U            /*!< CTL3 register offset */
#define USART_GDCTL_REG_OFFSET              0x000000D0U            /*!< GDCTL register offset */

/* USART5 register offset */
#define USART5_CTL0_REG_OFFSET              0x00000000U           /*!< CTL0 register offset */
#define USART5_CTL1_REG_OFFSET              0x00000004U           /*!< CTL1 register offset */
#define USART5_CTL2_REG_OFFSET              0x00000008U           /*!< CTL2 register offset */
#define USART5_STAT_REG_OFFSET              0x0000001CU           /*!< STAT register offset */
#define USART5_CHC_REG_OFFSET               0x000000C0U           /*!< CHC register offset */
#define USART5_RFCS_REG_OFFSET              0x000000D0U           /*!< RFCS register offset */

/* USART flag definitions */
/* USARTx(x=0,1,2)/UARTx(x=3,4) flags */
typedef enum
{
    /* flags in STAT0 register */
    USART_FLAG_CTS = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 9U),      /*!< CTS change flag */
    USART_FLAG_LBD = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 8U),      /*!< LIN break detected flag */
    USART_FLAG_TBE = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 7U),      /*!< transmit data buffer empty */
    USART_FLAG_TC = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 6U),       /*!< transmission complete */
    USART_FLAG_RBNE = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 5U),     /*!< read data buffer not empty */
    USART_FLAG_IDLE = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 4U),     /*!< IDLE frame detected flag */
    USART_FLAG_ORERR = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 3U),    /*!< overrun error flag*/
    USART_FLAG_NERR = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 2U),     /*!< noise error flag */
    USART_FLAG_FERR = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 1U),     /*!< frame error flag */
    USART_FLAG_PERR = USART_REGIDX_BIT(USART_STAT0_REG_OFFSET, 0U),     /*!< parity error flag */
    /* flags in STAT1 register */
    USART_FLAG_BSY = USART_REGIDX_BIT(USART_STAT1_REG_OFFSET, 16U),     /*!< busy flag */
    USART_FLAG_EB = USART_REGIDX_BIT(USART_STAT1_REG_OFFSET, 12U),      /*!< end of block flag */
    USART_FLAG_RT = USART_REGIDX_BIT(USART_STAT1_REG_OFFSET, 11U),      /*!< receiver timeout flag */
    /* flags in GDCTL register */
    USART_FLAG_CD = USART_REGIDX_BIT(USART_GDCTL_REG_OFFSET, 8U)        /*!< collision detected flag */
}usart_flag_enum;

